Repository: JiangNanGenius/floe-agent
Catalog: FloeAgent/FloeApp/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# settings.general_settings_view.the_queue_starts_a_new_turn
source: The queue starts a new turn after the current task ends; a steer is inserted into context after the current model output or tool call fully completes.
zh_hans: 队列会在当前任务结束后启动新一轮；引导会在当前模型输出或工具调用完整结束后插入上下文。

# settings.general_settings_view.voice_input
source: Voice Input
zh_hans: 语音输入

# settings.general_settings_view.when_automatic_recognition_has_no_result
source: When automatic recognition has no result, explicitly choose the language in use.
zh_hans: 自动识别无结果时，请明确选择正在使用的语言。

# settings.general_settings_view.when_on_an_extra_self_check
source: When on, an extra self-check runs without calling tools; CONFIRM is not shown when everything is correct, and a corrected version is appended if issues are found.
zh_hans: 开启后会额外进行一次不调用工具的自检；确认无误时不会显示 CONFIRM，发现问题时会追加修正版。

# settings.general_settings_view.whisper_speech_recognition
source: Whisper & speech recognition
zh_hans: Whisper 与语音识别

# settings.git_hub_settings_view.access_token
source: Access token
zh_hans: 访问令牌

# settings.git_hub_settings_view.account
source: Account
zh_hans: 账户

# settings.git_hub_settings_view.clone_into_current_workspace
source: Clone into current workspace
zh_hans: 克隆到当前工作区

# settings.git_hub_settings_view.clone_repository
source: Clone repository
zh_hans: 克隆仓库

# settings.git_hub_settings_view.cloud_repository
source: Cloud repository
zh_hans: 云端仓库

# settings.git_hub_settings_view.create
source: Create
zh_hans: 创建

# settings.git_hub_settings_view.description_optional
source: Description (optional)
zh_hans: 说明（可选）

# settings.git_hub_settings_view.enter_the_code_on_github
source: Enter the code on GitHub
zh_hans: 在 GitHub 输入验证码

# settings.git_hub_settings_view.github_connection
source: GitHub connection
zh_hans: GitHub 连接

# settings.git_hub_settings_view.github_connection_error
source: GitHub connection error
zh_hans: GitHub 连接错误

# settings.git_hub_settings_view.github_fine_grained_access_token
source: GitHub fine-grained access token
zh_hans: GitHub 细粒度访问令牌

# settings.git_hub_settings_view.github_source_control
source: GitHub & source control
zh_hans: GitHub 与源码管理

# settings.git_hub_settings_view.new_github_repository
source: New GitHub repository
zh_hans: 新建 GitHub 仓库

# settings.git_hub_settings_view.open_github_authorization_page
source: Open GitHub authorization page
zh_hans: 打开 GitHub 授权页

# settings.git_hub_settings_view.private
source: Private
zh_hans: 私有

# settings.git_hub_settings_view.private_repository
source: Private repository
zh_hans: 私有仓库

# settings.git_hub_settings_view.public
source: Public
zh_hans: 公开

# settings.git_hub_settings_view.refresh_repository_list
source: Refresh repository list
zh_hans: 刷新仓库列表

# settings.git_hub_settings_view.repository_name
source: Repository name
zh_hans: 仓库名称

# settings.git_hub_settings_view.sign_in_credentials_are_kept_only
source: Sign-in credentials are kept only in this device's Keychain. Floe never writes tokens into repositories, remote addresses, logs or model context.
zh_hans: 登录凭据只保存在本机钥匙串。Floe 不会把令牌写入仓库、远程地址、日志或模型上下文。

# settings.git_hub_settings_view.sign_in_to_github
source: Sign in to GitHub
zh_hans: 登录 GitHub

source: The connection completes automatically after authorization; Floe checks status at the interval GitHub returns.
zh_hans: 授权后会自动完成连接；Floe 按 GitHub 返回的间隔检查状态。

# settings.git_hub_settings_view.the_current_account_has_no_accessible
source: The current account has no accessible repositories
zh_hans: 当前账户没有可访问的仓库

# settings.git_hub_settings_view.use_access_token_advanced
source: Use access token (advanced)
zh_hans: 使用访问令牌（高级）

# settings.git_hub_settings_view.verify_and_connect
source: Verify and connect
zh_hans: 验证并连接

# settings.git_hub_settings_view.will_create_subfolder
source: Will create subfolder %@
zh_hans: 将创建子文件夹 %@

# settings.licenses.bundled.footer
source: Every notice here is a file copied into this build. A file missing from the build is shown as unavailable instead of being hidden.
zh_hans: 此处每一条都是复制进本构建的文件；构建中缺失的文件会显示为不可用，而不是被隐藏。

# settings.licenses.bundled.header
source: Bundled license notices
zh_hans: 随包许可全文

# settings.licenses.count
source: %d components
zh_hans: %d 个构件

# settings.licenses.document.cad.title
source: Floe CAD engine
zh_hans: Floe CAD 引擎

# settings.licenses.document.codeblitz_bundle.title
source: CodeBlitz bundle notices
zh_hans: CodeBlitz 随包声明

# settings.licenses.document.conversion_fonts.title
source: Conversion document fonts
zh_hans: 文档转换字体

# settings.licenses.document.conversion_third_party.title
source: Offline document conversion
zh_hans: 离线文档转换

# settings.licenses.document.dxf.title
source: dxf.js bundle notices
zh_hans: dxf.js 随包声明

# settings.licenses.document.font
source: Font: %@
zh_hans: 字体：%@

# settings.licenses.document.gerber.title
source: gerber-to-svg bundle notices
zh_hans: gerber-to-svg 随包声明

# settings.licenses.document.ide_vendor.title
source: CodeBlitz bundled dependencies
zh_hans: CodeBlitz 随包依赖

# settings.licenses.document.mesh.title
source: mesh.js bundle notices
zh_hans: mesh.js 随包声明

# settings.licenses.document.occt_exception.title
source: OCCT LGPL exception
zh_hans: OCCT LGPL 例外条款

# settings.licenses.document.tinyemu.title
source: TinyEMU 2019-12-21 and slirp
zh_hans: TinyEMU 2019-12-21 与 slirp

# settings.licenses.document.viewers.title
source: Engineering viewers
zh_hans: 工程查看器

# settings.licenses.document.whisper_model.title
source: Whisper model and tokenizer
zh_hans: Whisper 模型与分词器

# settings.licenses.document.whisper_tokenizer.title
source: Whisper tokenizer
zh_hans: Whisper 分词器

# settings.licenses.inventory.footer
source: Versions, licenses and sources come from the generated inventory that ships in this build; full texts are the bundled files.
zh_hans: 版本、许可与源码来自本构建随包的生成清单；全文来自随包文件。

# settings.licenses.inventory.header
source: Complete component inventory
zh_hans: 完整构件清单

# settings.licenses.inventory.link
source: Open the component inventory
zh_hans: 打开构件清单

# settings.licenses.inventory.search
source: Search components
zh_hans: 搜索构件

# settings.licenses.inventory.title
source: Component inventory
zh_hans: 构件清单

# settings.licenses.kind.full_text
source: full text
zh_hans: 完整文本

# settings.licenses.kind.grant
source: font grant
zh_hans: 字体授权

# settings.licenses.kind.notices
source: bundled dependency notices
zh_hans: 随包依赖声明

# settings.licenses.kind.provenance
source: origin and terms
zh_hans: 来源与条款

# settings.licenses.manifest_missing
source: This build has no generated license inventory. Run scripts/license_inventory.sh and rebuild.
zh_hans: 此构建缺少生成的许可清单。请运行 scripts/license_inventory.sh 后重新构建。

# settings.licenses.note.guest_image
source: The Linux guest is a separately distributed downloadable image built from Debian 13 riscv64 packages plus a pinned kernel, bbl and static glibc. Its source and license texts are recorded in the pinned image manifest; they are not linked into the app binary.
zh_hans: Linux 客体是从 Debian 13 riscv64 软件包加固定内核、bbl 与静态 glibc 构建、单独分发的可下载镜像，其源码与许可文本记录在固定的镜像清单中，不链接进 App 二进制。

# settings.licenses.note.libgit2
source: libgit2 is licensed under GPL-2.0 with a linking exception that explicitly permits linking it into this application. The complete GPL-2.0 text ships in this app as Licenses/libgit2-COPYING.txt, and libgit2's source is the pinned repository in the component list.
zh_hans: libgit2 采用 GPL-2.0 并附带链接例外，明确允许将其链接进本应用。完整的 GPL-2.0 文本随本应用打包为 Licenses/libgit2-COPYING.txt，libgit2 源码为构件清单中的固定仓库。

# settings.licenses.note.mlx_vendor
source: mlx-swift-lm is vendored at ThirdParty/MLXSwiftLM from upstream commit d5d8b290e601ac1bf11f24635f8f811a83b98bf8 with a minimal Floe prefill-stability patch; the complete MIT text ships in the app as Licenses/MLXSwiftLM-LICENSE.txt.
zh_hans: mlx-swift-lm 内置固定于 ThirdParty/MLXSwiftLM，来源为上游提交 d5d8b290e601ac1bf11f24635f8f811a83b98bf8，并附带最小的 Floe 预填充稳定性补丁；完整 MIT 文本随 App 以 Licenses/MLXSwiftLM-LICENSE.txt 提供。

# settings.licenses.note.occt
source: Open CASCADE Technology and occt-import-js are LGPL-2.1 with the OCCT exception; their complete texts and the exception ship in the app bundle.
zh_hans: Open CASCADE Technology 与 occt-import-js 采用 LGPL-2.1 及 OCCT 例外；完整文本与例外条款随 App 打包。

# settings.licenses.note.office
source: The native Office engine is Collabora Online (LibreOffice-based) at the pinned commit, MPL-2.0. The qualified engine bundle retains its upstream third-party license files; the complete engine notice inventory remains a separate office qualification gate.
zh_hans: 原生 Office 引擎为固定提交的 Collabora Online（基于 LibreOffice），采用 MPL-2.0。合格引擎包中保留了上游第三方许可文件；完整的引擎声明清单仍是独立的 Office 资格门禁。

# settings.licenses.note.verification
source: Every Swift package license was read from the resolved checkout license file. scripts/license-evidence.json records the exact file and sha256, and the generator re-verifies them when a checkout is present.
zh_hans: 每个 Swift 软件包的许可证均读取自解析后的 checkout 许可文件。scripts/license-evidence.json 记录了具体文件与 sha256，生成器会在 checkout 存在时重新校验。

# settings.licenses.notes.header
source: License notes
zh_hans: 许可说明

# settings.licenses.repository_license
source: Repository license (MPL-2.0)
zh_hans: 仓库许可证（MPL-2.0）

# settings.licenses.section.conversion
source: Document conversion
zh_hans: 文档转换

# settings.licenses.section.documents
source: Documents and archives
zh_hans: 文档与归档

# settings.licenses.section.engineering
source: Engineering viewers
zh_hans: 工程查看器

# settings.licenses.section.engines
source: Engines and runners
zh_hans: 引擎与运行器

# settings.licenses.section.fonts
source: Bundled fonts
zh_hans: 随包字体

# settings.licenses.section.ide
source: Offline IDE
zh_hans: 离线 IDE

# settings.licenses.section.media
source: Image and media
zh_hans: 图像与媒体

# settings.licenses.section.office
source: Office engine
zh_hans: Office 引擎

# settings.licenses.section.python
source: Python runtimes and packages
zh_hans: Python 运行时与数据包

# settings.licenses.section.speech
source: Speech
zh_hans: 语音

# settings.licenses.section.swift
source: Swift packages
zh_hans: Swift 软件包

# settings.licenses.section.web
source: Bundled web and data scripts
zh_hans: 随包 Web 与数据脚本

# settings.licenses.this_app
source: This app
zh_hans: 本应用

# settings.permissions.default_mode
source: Default Approval Mode
zh_hans: 默认授权模式

# settings.permissions.full_control
source: Full Control
zh_hans: 完全控制

# settings.permissions.full_control.info
source: Full control requires Face ID or passcode plus a risk acknowledgement, and applies per host for a limited window.
zh_hans: 完全控制需要 Face ID 或密码并加以风险确认，且按主机在有限时间窗内生效。

# settings.permissions.gate
source: Catastrophic Action Protection
zh_hans: 灾难性操作保护

# settings.permissions.gate.armed
source: Protection armed
zh_hans: 保护已启用

# settings.permissions.gate.fail_closed
source: Protection unavailable — all destructive commands blocked
zh_hans: 保护不可用——所有破坏性命令均被阻止

# settings.permissions.gate.footer
source: This independent layer blocks high-confidence destructive commands before any approval policy runs. It cannot be disabled from settings.
zh_hans: 这一独立层在任何授权策略之前拦截高置信度的破坏性命令，无法在设置中关闭。

# settings.permissions.grants
source: Saved Approvals
zh_hans: 已保存的授权

# settings.permissions.grants.empty
source: No saved approvals
zh_hans: 暂无已保存的授权

# settings.permissions.grants.footer
source: Approvals you chose to remember for a project, host or run. Revoking takes effect immediately.
zh_hans: 你选择记住的项目、主机或任务级授权。撤销立即生效。

# settings.permissions.grants.revoke
source: Revoke
zh_hans: 撤销

# settings.permissions.grants.session
source: this session
zh_hans: 本次会话

# settings.permissions.scope.global
source: all scopes
zh_hans: 全部范围

# settings.permissions.scope.host
source: host
zh_hans: 主机

# settings.permissions.scope.project
source: project
zh_hans: 项目

# settings.privacy.apikeys
source: Configured API Keys
zh_hans: 已配置的 API Key

# settings.privacy.apikeys.count
source: %lld configured
zh_hans: 已配置 %lld 个

# settings.privacy.clear.footer
source: Both operations ask for confirmation and report exactly what was deleted.
zh_hans: 两项操作均需二次确认，并如实回显删除数量。

# settings.privacy.clear_history
source: Clear Local History
zh_hans: 清除本地记录

# settings.privacy.clear_history.confirm
source: Delete Everything
zh_hans: 全部删除

# settings.privacy.clear_history.message
source: Deletes all conversations, runs and saved approvals from this device. This cannot be undone.
zh_hans: 删除本设备上的全部对话、运行记录与已保存授权。此操作不可撤销。

# settings.privacy.clear_models
source: Clear Model Configuration
zh_hans: 清除模型配置

# settings.privacy.clear_models.confirm
source: Delete Configuration
zh_hans: 删除配置

# settings.privacy.clear_models.message
source: Deletes all providers and models and removes their API keys from Keychain. This cannot be undone.
zh_hans: 删除全部供应商与模型，并从钥匙串移除对应 API Key。此操作不可撤销。

# settings.privacy.data
source: Local Data
zh_hans: 本地数据

# settings.privacy.diagnostics
source: Diagnostics
zh_hans: 诊断

# settings.privacy.export
source: Export Diagnostics
zh_hans: 导出诊断信息

# settings.privacy.export.footer
source: The export contains counts and capability states only; secrets are redacted before writing.
zh_hans: 导出内容仅含计数与能力状态；秘密信息在写入前已脱敏。

# settings.privacy.keychain
source: Keychain
zh_hans: 钥匙串

# settings.privacy.keychain.footer
source: API keys and host credentials live only in Keychain. The settings center shows whether they are configured — never the values.
zh_hans: API Key 与主机凭证只存于钥匙串。设置中心仅显示是否已配置，绝不回显内容。

# settings.privacy.keychain.state
source: Keychain Status
zh_hans: 钥匙串状态

# settings.privacy.report.conversations
source: %lld conversations
zh_hans: %lld 个对话

# settings.privacy.report.empty
source: Nothing to delete
zh_hans: 没有可删除的内容

# settings.privacy.report.grants
source: %lld approvals
zh_hans: %lld 条授权

# settings.privacy.report.keychain
source: %lld Keychain items
zh_hans: %lld 个钥匙串条目

# settings.privacy.report.runs
source: %lld runs
zh_hans: %lld 次运行

# settings.privacy_security_view.prefer_face_id_touch_id
source: Prefer Face ID / Touch ID
zh_hans: 优先使用 Face ID / Touch ID

# settings.privacy_security_view.the_device_has_no_usable_authentication
source: The device has no usable authentication configured.
zh_hans: 设备未设置可用的身份验证。

# settings.privacy_security_view.when_on_biometrics_are_preferred_the
source: When on, biometrics are preferred; the device passcode is used only when biometrics are unavailable or disabled.
zh_hans: 开启时优先显示生物识别；设备不支持或关闭后才使用设备密码。

# settings.remote.auto_reconnect
source: Auto-reconnect
zh_hans: 自动重连

# settings.remote.hosts
source: Trusted Hosts
zh_hans: 受信任主机

# settings.remote.hosts.count
source: Configured hosts
zh_hans: 已配置主机

# settings.remote.hosts.empty
source: No hosts configured
zh_hans: 尚未配置主机

# settings.remote.hosts.footer
source: Host keys and fingerprints are managed from the Hosts tab when connecting.
zh_hans: 主机密钥与指纹在连接时于“主机”页管理。

# settings.remote.idle_disconnect
source: Idle disconnect: %lld min
zh_hans: 空闲断开：%lld 分钟

# settings.remote.idle_disconnect.footer
source: Idle sessions disconnect after this many minutes to release remote resources.
zh_hans: 空闲会话在设定分钟数后断开，以释放远程资源。

# settings.remote.keep_alive
source: Keep Alive
zh_hans: 保持长连接

# settings.remote.session
source: Session
zh_hans: 会话

# settings.remote.sessions.active
source: Active sessions
zh_hans: 活跃会话

# settings.remote.ssh
source: SSH Defaults
zh_hans: SSH 默认行为

# settings.remote.vnc
source: VNC Defaults
zh_hans: VNC 默认行为

# settings.remote_settings_view.active
source: %@ active
zh_hans: %@ 个活跃

# settings.remote_settings_view.configured
source: %@ configured
zh_hans: %@ 台已配置

# settings.remote_settings_view.manage_hosts
source: Manage hosts
zh_hans: 管理主机

# settings.section.auxiliary
source: Auxiliary Models
zh_hans: 辅助模型

# settings.section.background_execution
source: Background Execution
zh_hans: 后台执行

# settings.section.diagnostics
source: Diagnostics & About
zh_hans: 诊断与关于

# settings.section.execution
source: Execution Environment
zh_hans: 执行环境

# settings.section.files
source: Files
zh_hans: 文件

# settings.section.general
source: General
zh_hans: 通用

# settings.section.permissions
source: Agent & Permissions
zh_hans: Agent 与权限

# settings.section.privacy
source: Privacy & Security
zh_hans: 隐私与安全

# settings.section.providers
source: Models & Providers
zh_hans: 模型与供应商

# settings.section.remote
source: Hosts & Remote Sessions
zh_hans: 主机与远程会话

# settings.section.sync
source: Sync
zh_hans: 同步

# settings.section.usage
source: Usage
zh_hans: 用量统计

# settings.settings_root_view.allow_finger_drawing
source: Allow finger drawing
zh_hans: 允许手指绘画

# settings.settings_root_view.automatic
source: Automatic
zh_hans: 自动判断

# settings.settings_root_view.canvas
source: Canvas
zh_hans: 画布

# settings.settings_root_view.canvas_assistant_model
source: Canvas Assistant Model
zh_hans: 画布助手模型

# settings.settings_root_view.chart
source: Chart
zh_hans: 图表

# settings.settings_root_view.configuration_not_saved
source: Configuration not saved
zh_hans: 配置未保存

# settings.settings_root_view.conversion_happens_only_when_you_tap
source: Conversion happens only when you tap “Understand & organize” or accept a “Convert to card” suggestion; original handwriting is never replaced automatically.
zh_hans: 只有在你点“理解并整理”或接受“转为卡片”建议时才会转换，原始手写不会被自动替换。

# settings.settings_root_view.current_understanding_path
source: Current understanding path
zh_hans: 当前理解路径

# settings.settings_root_view.default_organization_method
source: Default organization method
zh_hans: 默认整理方式

# settings.settings_root_view.default_thickness
source: Default thickness
zh_hans: 默认粗细

# settings.settings_root_view.double_tap_pencil
source: Double-tap Pencil
zh_hans: 双击 Pencil

# settings.settings_root_view.inherit_the_agent_default_model
source: Inherit the agent default model
zh_hans: 继承 Agent 默认模型

# settings.settings_root_view.inherit_the_auxiliary_vision_model
source: Inherit the auxiliary vision model
zh_hans: 继承辅助视觉模型

# settings.settings_root_view.keep_original_strokes_after_organizing
source: Keep original strokes after organizing
zh_hans: 整理后保留原笔迹

# settings.settings_root_view.memories_personalization
source: Memories & personalization
zh_hans: 记忆与个性化

# settings.settings_root_view.not_configured
source: Not configured
zh_hans: 尚未配置

# settings.settings_root_view.open_brush_menu
source: Open brush menu
zh_hans: 打开画笔菜单

# settings.settings_root_view.please_try_again
source: Please try again.
zh_hans: 请稍后重试。

# settings.settings_root_view.saving_or_syncing_the_canvas_configuration
source: Saving or syncing the canvas configuration failed
zh_hans: 画布配置保存或同步失败

# settings.settings_root_view.screen_understanding_model
source: Screen-understanding model
zh_hans: 画面理解模型

# settings.settings_root_view.show_grid
source: Show grid
zh_hans: 显示网格

# settings.settings_root_view.snap_to_grid
source: Snap to grid
zh_hans: 吸附到网格

# settings.settings_root_view.switch_to_eraser
source: Switch to eraser
zh_hans: 切换橡皮

# settings.settings_root_view.the_canvas_assistant_handles_search_reading
source: The canvas assistant handles search, reading assets and calling generation tools; the screen-understanding model recognizes handwriting, sketches and visual content that non-multimodal models cannot read.
zh_hans: 画布助手负责搜索、读取素材与调用生成工具；画面理解模型负责识别笔迹、草图和非多模态模型无法读取的视觉内容。

# settings.settings_root_view.turning_sync_off_only_stops_transfers
source: Turning sync off only stops transfers; it does not delete uploaded canvases or assets.
zh_hans: 关闭同步只停止传输，不会删除已上传的画布或素材。

# settings.settings_root_view.understand_and_organize
source: Understand and organize
zh_hans: 理解与整理

# settings.sync.configuration.enabled
source: Configuration Data
zh_hans: 配置数据同步

# settings.sync.configuration.footer
source: Syncs providers, model settings, defaults, and onboarding preferences through your private CloudKit database. Changes made while paused stay on this device and are queued for later.
zh_hans: 通过你的私有 CloudKit 数据库同步供应商、模型设置、默认选择和向导偏好。暂停期间的更改保留在本机，并会排队等待以后同步。

# settings.sync.configuration.header
source: Configuration
zh_hans: 配置数据

# settings.sync.configuration.status
source: Status
zh_hans: 同步状态

# settings.sync.enabled
source: Sync with iCloud
zh_hans: 使用 iCloud 同步

# settings.sync.icloud.available
source: Available
zh_hans: 可用

# settings.sync.icloud.unavailable
source: Not signed in
zh_hans: 未登录 iCloud

# settings.sync.master.footer
source: The master switch controls all cross-device sync. Turning it off moves configured provider keys to this device's local Keychain and pauses CloudKit traffic.
zh_hans: 总开关控制全部跨设备同步。关闭后，已配置的供应商密钥会迁移到本机钥匙串，同时暂停 CloudKit 网络同步。

# settings.sync.master.header
source: iCloud Sync
zh_hans: iCloud 同步

# settings.sync.now
source: Sync Now
zh_hans: 立即同步

# settings.sync.secrets.footer
source: API keys use iCloud Keychain only when the master switch and that provider's own Keychain switch are both enabled. SSH and VNC credentials always stay on this device.
zh_hans: 只有总开关和对应供应商的钥匙串开关都开启时，API Key 才会使用 iCloud 钥匙串。SSH 与 VNC 凭据始终只保存在本机。

# settings.sync.secrets.title
source: API Key Sync
zh_hans: API Key 同步

# settings.sync.status.error
source: Sync failed
zh_hans: 同步失败

# settings.sync.status.paused
source: Paused
zh_hans: 已暂停

# settings.sync.status.synced
source: Up to Date
zh_hans: 已是最新

# settings.sync.status.syncing
source: Syncing…
zh_hans: 正在同步…

# settings.sync.status.waiting_secret
source: Waiting for iCloud Keychain
zh_hans: 等待 iCloud 钥匙串

# settings.sync_settings_view.api_keys_saved_ssh_vnc_keys
source: API keys, saved SSH/VNC keys and website passwords sync only through iCloud Keychain. Temporary task and project credentials are never uploaded.
zh_hans: API Key、已保存 SSH/VNC 密钥和网页密码仅通过 iCloud Keychain 同步。任务和项目临时凭据永不上传。

# settings.sync_settings_view.off_by_default_enabling_requires_device
source: Off by default. Enabling requires device-identity verification; non-exportable device keys remain only on this device.
zh_hans: 默认关闭。启用需要验证设备身份；不可导出的设备密钥仍只存在于当前设备。

# settings.sync_settings_view.sync_explicitly_saved_keys_and_website
source: Sync explicitly saved keys and website passwords
zh_hans: 同步已明确保存的密钥和网页密码

# settings.sync_settings_view.sync_saved_credentials
source: Sync saved credentials
zh_hans: 同步已保存凭据

# settings.title
source: Settings
zh_hans: 设置

# settings.usage_statistics_view.all
source: All
zh_hans: 全部

# settings.usage_statistics_view.average_generation_speed
source: Average generation speed
zh_hans: 平均生成速度

# settings.usage_statistics_view.average_response_time
source: Average response time
zh_hans: 平均响应耗时

# settings.usage_statistics_view.average_time_to_first_response
source: Average time to first response
zh_hans: 平均开始响应

# settings.usage_statistics_view.by_conversation
source: By conversation
zh_hans: 按会话

# settings.usage_statistics_view.by_model
source: By model
zh_hans: 按模型

# settings.usage_statistics_view.by_provider
source: By provider
zh_hans: 按供应商

# settings.usage_statistics_view.context_reuse
source: Context reuse
zh_hans: 上下文复用

# settings.usage_statistics_view.context_reuse_rate
source: Context reuse rate
zh_hans: 上下文复用率

# settings.usage_statistics_view.context_reuse_reasoning
source: Context reuse %@ · reasoning %@
zh_hans: 上下文复用 %@ · 思考用量 %@

# settings.usage_statistics_view.date
source: Date
zh_hans: 日期

# settings.usage_statistics_view.filter
source: Filter
zh_hans: 筛选

# settings.usage_statistics_view.fragments_sec
source: %@ tokens/s
zh_hans: %@ tokens/秒

# settings.usage_statistics_view.fragments_sec.one
source: %@ token/s
zh_hans: %@ tokens/秒

# settings.usage_statistics_view.input_output
source: Input %@ · output %@
zh_hans: 输入 %@ · 输出 %@

# settings.usage_statistics_view.input_usage
source: Input usage
zh_hans: 输入用量

# settings.usage_statistics_view.last_30_days
source: Last 30 days
zh_hans: 近 30 天

# settings.usage_statistics_view.model
source: Model
zh_hans: 模型

# settings.usage_statistics_view.no_data
source: No data
zh_hans: 暂无数据
